AhmedMesh4/0/total(p)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      total(p);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1500;

boundaryField
{
    symWall
    {
        type            symmetry;
    }
    outlet
    {
        type            calculated;
        value           uniform 1500;
    }
    upperWall
    {
        type            calculated;
        value           uniform 1500;
    }
    inlet
    {
        type            calculated;
        value           uniform 1500;
    }
    left
    {
        type            calculated;
        value           uniform 1500;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 1500;
    }
    CarBody_wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
